# Pandas mini-tutorial

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/khkim/anaconda3/lib/python3.6/site-packages (0.23.0)
Requirement already satisfied: python-dateutil>=2.5.0 in /Users/khkim/anaconda3/lib/python3.6/site-packages (from pandas) (2.7.3)
Requirement already satisfied: pytz>=2011k in /Users/khkim/anaconda3/lib/python3.6/site-packages (from pandas) (2018.4)
Requirement already satisfied: numpy>=1.9.0 in /Users/khkim/anaconda3/lib/python3.6/site-packages (from pandas) (1.16.0)
Requirement already satisfied: six>=1.5 in /Users/khkim/anaconda3/lib/python3.6/site-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)

## pandas.Series: Ordered, homogeneous dictionary

In [2]:
import pandas as pd

dictionary = {'a': 1, 'b': 2, 'c': 3}
series = pd.Series(dictionary)
series

a    1
b    2
c    3
dtype: int64

In [3]:
series.index

Index(['a', 'b', 'c'], dtype='object')

In [4]:
series.values

array([1, 2, 3])

In [5]:
for key, value in series.items():
    print(key, value)

a 1
b 2
c 3

In [6]:
series = series.sort_values(ascending=False)
series

c    3
b    2
a    1
dtype: int64

In [7]:
dictionary = {'a': 1, 'b': 2, 'c': 3.0}
series = pd.Series(dictionary)
series

a    1.0
b    2.0
c    3.0
dtype: float64

In [8]:
dictionary = {'a': 1, 'b': 2, 'c': 'three'}
series = pd.Series(dictionary)
series

a        1
b        2
c    three
dtype: object

In [9]:
dictionary = {'a': 1, 'b': 2, 'c': 3}
series = pd.Series(dictionary)
series % 2 == 0

a    False
b     True
c    False
dtype: bool

## pandas.DataFrame: Tabular data

In [10]:
dataframe = pd.DataFrame({
    'name': ['Monaco', 'Gibraltar', 'Vatican City'],
    'area': [1.98, 6.8, 0.44],
    'population': [36371, 29431, 900],
})
dataframe

           name  area  population
0        Monaco  1.98       36371
1     Gibraltar  6.80       29431
2  Vatican City  0.44         900

In [11]:
dataframe = pd.DataFrame(
    data=[('Monaco', 1.98, 36371),
          ('Gibraltar', 6.8, 29431),
          ('Vatican City', 0.44, 900)],
    columns=('name', 'area', 'population')
)
dataframe

           name  area  population
0        Monaco  1.98       36371
1     Gibraltar  6.80       29431
2  Vatican City  0.44         900

In [12]:
dataframe.name

0          Monaco
1       Gibraltar
2    Vatican City
Name: name, dtype: object

In [13]:
dataframe.name[1]

'Gibraltar'

In [14]:
dataframe.sort_values('area')

           name  area  population
2  Vatican City  0.44         900
0        Monaco  1.98       36371
1     Gibraltar  6.80       29431